package days24;

/**
 * @author 김예지
 * @date 2025. 3. 7.
 * @subject
 * @content
 */
public class Ex08 {

	public static void main(String[] args) {
		/* [제네릭(Generic)] 열거형(Enum) 애너테이션
		 	ㄴ jdk 1.5부터 제네릭스 추가
		 	ㄴ jdk 1.8부터 람다식 추가
		 	
		 	제네릭: 타입을 매개변수화하여 자료형을 처리하게 할 수 있는 클래스, 인터페이스, 메서드의 정의 방법
		 	- 코드의 재사용성을 높임.
		 	- 타입 안전성을 확보.
		 	- 주로 컬랙션 클래스에서 사용됨.
		 	
		 	<제네릭의 정의>
		 	다양한 타입의 객체를 다루는 메서드, 클래스, 인터페이스에서
		 	컴파일 시에 타입을 체크해주는 기능(기술)
		 	
		 	<제네릭의 장점>
		 	- 타입 안전성
		 	- 코드 재사용성
		 	- 타입 추론
		 	
		 	- 제네릭을 사용한 메서드: 제네릭 메서드
		 	- 제네릭을 사용한 인터페이스: 제네릭 인터페이스
		 	- 제네릭을 사용한 클래스: 제네릭 클래스
		 
		 */
		
		
	} // main
	
} // class
